
&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ОбработкаТабличныхЧастей.ПересчетСтроки(ТекущаяСтрока, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ОбработкаТабличныхЧастей.ПересчетСтроки(ТекущаяСтрока, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ОбработкаТабличныхЧастей.ПересчетСтроки(ТекущаяСтрока, Ложь);
КонецПроцедуры
